SOAPe/Templates/EWS/SyncFolderHierarchy.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:t="http://schemas.microsoft.com/exchange/services/2006/types">
  <soap:Body>
    <SyncFolderHierarchy  xmlns="http://schemas.microsoft.com/exchange/services/2006/messages">
      <FolderShape>
        <t:BaseShape>AllProperties</t:BaseShape>
      </FolderShape><!--DELETEMARKERSTART:SyncState-->
      <SyncState>
        <!--FIELD:SyncState;string-->
      </SyncState><!--DELETEMARKEREND:SyncState-->
    </SyncFolderHierarchy>
  </soap:Body>
</soap:Envelope>